demo-case/MDL/outputs/without_perf/sysbench.out
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Initializing worker threads...

Creating table 'sbtest1'...
Inserting 10000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 10 tps: 4059.98 qps: 4059.98 (r/w/o: 0.00/4059.98/0.00) lat (ms,95%): 4.25 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 10 tps: 3804.64 qps: 3804.64 (r/w/o: 0.00/3804.64/0.00) lat (ms,95%): 4.41 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 10 tps: 3893.01 qps: 3893.01 (r/w/o: 0.00/3893.01/0.00) lat (ms,95%): 4.25 err/s: 0.00 reconn/s: 0.00
monitoring begins
[ 4s ] thds: 10 tps: 3712.72 qps: 3712.72 (r/w/o: 0.00/3712.72/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 10 tps: 3778.87 qps: 3778.87 (r/w/o: 0.00/3778.87/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 10 tps: 3611.99 qps: 3611.99 (r/w/o: 0.00/3611.99/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 10 tps: 3654.46 qps: 3654.46 (r/w/o: 0.00/3654.46/0.00) lat (ms,95%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 10 tps: 3790.96 qps: 3790.96 (r/w/o: 0.00/3790.96/0.00) lat (ms,95%): 4.57 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 10 tps: 3641.86 qps: 3641.86 (r/w/o: 0.00/3641.86/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
monitoring ends
perf attached (mock)
[ 10s ] thds: 10 tps: 3636.09 qps: 3637.09 (r/w/o: 0.00/3637.09/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 10 tps: 4845.45 qps: 4844.45 (r/w/o: 0.00/4844.45/0.00) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 10 tps: 4693.60 qps: 4693.60 (r/w/o: 0.00/4693.60/0.00) lat (ms,95%): 3.75 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 10 tps: 5758.02 qps: 5758.02 (r/w/o: 0.00/5758.02/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 10 tps: 5849.29 qps: 5849.29 (r/w/o: 0.00/5849.29/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 10 tps: 5822.86 qps: 5822.86 (r/w/o: 0.00/5822.86/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 10 tps: 5605.83 qps: 5605.83 (r/w/o: 0.00/5605.83/0.00) lat (ms,95%): 3.02 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 10 tps: 5613.37 qps: 5613.37 (r/w/o: 0.00/5613.37/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 10 tps: 5249.51 qps: 5249.51 (r/w/o: 0.00/5249.51/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 10 tps: 5263.59 qps: 5263.59 (r/w/o: 0.00/5263.59/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 10 tps: 5532.44 qps: 5532.44 (r/w/o: 0.00/5532.44/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 10 tps: 5899.34 qps: 5899.34 (r/w/o: 0.00/5899.34/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 10 tps: 5733.74 qps: 5733.74 (r/w/o: 0.00/5733.74/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 10 tps: 5406.29 qps: 5406.29 (r/w/o: 0.00/5406.29/0.00) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 10 tps: 5679.62 qps: 5679.62 (r/w/o: 0.00/5679.62/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 10 tps: 5734.02 qps: 5734.02 (r/w/o: 0.00/5734.02/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 10 tps: 5785.42 qps: 5785.42 (r/w/o: 0.00/5785.42/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 10 tps: 5730.94 qps: 5730.94 (r/w/o: 0.00/5730.94/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 10 tps: 5883.12 qps: 5883.12 (r/w/o: 0.00/5883.12/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 10 tps: 5825.59 qps: 5825.59 (r/w/o: 0.00/5825.59/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 10 tps: 5847.15 qps: 5847.15 (r/w/o: 0.00/5847.15/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 10 tps: 5861.26 qps: 5861.26 (r/w/o: 0.00/5861.26/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 10 tps: 5821.89 qps: 5821.89 (r/w/o: 0.00/5821.89/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 10 tps: 5793.54 qps: 5793.54 (r/w/o: 0.00/5793.54/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 10 tps: 5808.41 qps: 5808.41 (r/w/o: 0.00/5808.41/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 10 tps: 5596.64 qps: 5596.64 (r/w/o: 0.00/5596.64/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 10 tps: 5470.07 qps: 5470.07 (r/w/o: 0.00/5470.07/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 10 tps: 5538.98 qps: 5538.98 (r/w/o: 0.00/5538.98/0.00) lat (ms,95%): 3.25 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 10 tps: 5645.42 qps: 5645.42 (r/w/o: 0.00/5645.42/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 10 tps: 5761.19 qps: 5761.19 (r/w/o: 0.00/5761.19/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 10 tps: 5796.39 qps: 5796.39 (r/w/o: 0.00/5796.39/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 10 tps: 5822.44 qps: 5822.44 (r/w/o: 0.00/5822.44/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 10 tps: 5734.62 qps: 5734.62 (r/w/o: 0.00/5734.62/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 10 tps: 5821.00 qps: 5821.00 (r/w/o: 0.00/5821.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 10 tps: 5839.02 qps: 5839.02 (r/w/o: 0.00/5839.02/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 10 tps: 5811.00 qps: 5811.00 (r/w/o: 0.00/5811.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 10 tps: 5804.73 qps: 5804.73 (r/w/o: 0.00/5804.73/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 10 tps: 5901.20 qps: 5901.20 (r/w/o: 0.00/5901.20/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 10 tps: 5891.16 qps: 5891.16 (r/w/o: 0.00/5891.16/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 10 tps: 5815.19 qps: 5815.19 (r/w/o: 0.00/5815.19/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 10 tps: 5851.09 qps: 5851.09 (r/w/o: 0.00/5851.09/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 10 tps: 5820.56 qps: 5820.56 (r/w/o: 0.00/5820.56/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 10 tps: 5891.94 qps: 5891.94 (r/w/o: 0.00/5891.94/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 10 tps: 5850.97 qps: 5850.97 (r/w/o: 0.00/5850.97/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 10 tps: 5845.08 qps: 5845.08 (r/w/o: 0.00/5845.08/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 10 tps: 5786.03 qps: 5786.03 (r/w/o: 0.00/5786.03/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 10 tps: 5890.04 qps: 5890.04 (r/w/o: 0.00/5890.04/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 10 tps: 5740.93 qps: 5740.93 (r/w/o: 0.00/5740.93/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 10 tps: 5823.00 qps: 5823.00 (r/w/o: 0.00/5823.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 10 tps: 5618.98 qps: 5618.98 (r/w/o: 0.00/5618.98/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 10 tps: 5730.04 qps: 5730.04 (r/w/o: 0.00/5730.04/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 10 tps: 5596.02 qps: 5596.02 (r/w/o: 0.00/5596.02/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 10 tps: 5643.98 qps: 5643.98 (r/w/o: 0.00/5643.98/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 10 tps: 5646.93 qps: 5646.93 (r/w/o: 0.00/5646.93/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 10 tps: 5630.05 qps: 5630.05 (r/w/o: 0.00/5630.05/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 10 tps: 5735.84 qps: 5735.84 (r/w/o: 0.00/5735.84/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 10 tps: 5734.13 qps: 5734.13 (r/w/o: 0.00/5734.13/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 10 tps: 5680.01 qps: 5680.01 (r/w/o: 0.00/5680.01/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 10 tps: 5689.99 qps: 5689.99 (r/w/o: 0.00/5689.99/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 10 tps: 5545.98 qps: 5545.98 (r/w/o: 0.00/5545.98/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 10 tps: 5595.01 qps: 5595.01 (r/w/o: 0.00/5595.01/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
perf detached (mock)
[ 71s ] thds: 10 tps: 3348.02 qps: 3348.02 (r/w/o: 0.00/3348.02/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 10 tps: 3559.00 qps: 3559.00 (r/w/o: 0.00/3559.00/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 10 tps: 3415.99 qps: 3415.99 (r/w/o: 0.00/3415.99/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 10 tps: 3331.99 qps: 3331.99 (r/w/o: 0.00/3331.99/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 10 tps: 3316.99 qps: 3316.99 (r/w/o: 0.00/3316.99/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 10 tps: 3771.02 qps: 3771.02 (r/w/o: 0.00/3771.02/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 10 tps: 4015.05 qps: 4015.05 (r/w/o: 0.00/4015.05/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 10 tps: 3288.00 qps: 3288.00 (r/w/o: 0.00/3288.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 10 tps: 3389.87 qps: 3389.87 (r/w/o: 0.00/3389.87/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 10 tps: 3576.08 qps: 3576.08 (r/w/o: 0.00/3576.08/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           414250
        other:                           0
        total:                           414250
    transactions:                        414250 (5177.91 per sec.)
    queries:                             414250 (5177.91 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          80.0026s
    total number of events:              414250

Latency (ms):
         min:                                    0.59
         avg:                                    1.93
         max:                                   22.87
         95th percentile:                        3.62
         sum:                               799709.88

Threads fairness:
    events (avg/stddev):           41425.0000/86.80
    execution time (avg/stddev):   79.9710/0.00

Done